In [1]:
import pandas as pd

In [6]:
movies = pd.read_csv('movies.csv', index_col = 'Title')
movies.head()

                              Rank       Studio       Gross  Year
Title
Avengers: Endgame                1  Buena Vista  $2,796.30   2019
Avatar                           2          Fox  $2,789.70   2009
Titanic                          3    Paramount  $2,187.50   1997
Star Wars: The Force Awakens     4  Buena Vista  $2,068.20   2015
Avengers: Infinity War           5  Buena Vista  $2,048.40   2018

In [7]:
movies.tail()

                          Rank           Studio     Gross  Year
Title
Yogi Bear                  778  Warner Brothers  $201.60   2010
Garfield: The Movie        779              Fox  $200.80   2004
Cats & Dogs                780  Warner Brothers  $200.70   2001
The Hunt for Red October   781        Paramount  $200.50   1990
Valkyrie                   782              MGM  $200.30   2008

In [11]:
print(len(movies), movies.shape, movies.size)

782 (782, 4) 3128

In [13]:
# Ver el tipo de columnas
movies.dtypes

Rank       int64
Studio    object
Gross     object
Year       int64
dtype: object

In [29]:
# Extraer columnas
movies.iloc[499]

Rank           500
Studio         Fox
Gross     $288.30
Year          2018
Name: Maze Runner: The Death Cure, dtype: object

In [30]:
movies.loc['Forrest Gump']

Rank            119
Studio    Paramount
Gross      $677.90
Year           1994
Name: Forrest Gump, dtype: object

In [32]:
movies.loc['101 Dalmatians']

                Rank       Studio     Gross  Year
Title
101 Dalmatians   425  Buena Vista  $320.70   1996
101 Dalmatians   708  Buena Vista  $215.90   1961

In [36]:
movies.sort_values(by = "Year", ascending = False).head()

                            Rank     Studio     Gross  Year
Title
Men in Black International   686       Sony  $220.80   2019
The Secret Life of Pets 2    670  Universal  $225.90   2019
Dark Phoenix                 603        Fox  $245.10   2019
Glass                        591  Universal  $247.00   2019
Us                           572  Universal  $254.70   2019

In [38]:
movies.sort_values(by = ["Year", "Gross"], ascending = False).head()

,Rank,Studio,Gross,Year
Title,,,,
Aladdin,59,Buena Vista,$880.20,2019
The Wandering Earth,114,China Film Corporation,$699.80,2019
Toy Story 4,198,Buena Vista,$519.80,2019
How to Train Your Dragon: The Hidden World,199,Universal,$519.80,2019
Pokemon Detective Pikachu,263,Warner Brothers,$427.50,2019

In [40]:
movies.sort_index().head()

                  Rank           Studio     Gross  Year
Title
10,000 B.C.        536  Warner Brothers  $269.80   2008
101 Dalmatians     708      Buena Vista  $215.90   1961
101 Dalmatians     425      Buena Vista  $320.70   1996
2 Fast 2 Furious   632        Universal  $236.40   2003
2012                93             Sony  $769.70   2009

### Counting values in a Series

We can extract a single column of data from a `DataFrame` as a `Series`.

In [42]:
movies['Studio']

Title
Avengers: Endgame                   Buena Vista
Avatar                                      Fox
Titanic                               Paramount
Star Wars: The Force Awakens        Buena Vista
Avengers: Infinity War              Buena Vista
                                     ...
Yogi Bear                       Warner Brothers
Garfield: The Movie                         Fox
Cats & Dogs                     Warner Brothers
The Hunt for Red October              Paramount
Valkyrie                                    MGM
Name: Studio, Length: 782, dtype: object

In [45]:
movies['Studio'].value_counts().head(10)

Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Paramount           76
Dreamworks          27
Lionsgate           21
New Line            16
TriStar             11
Name: Studio, dtype: int64

### Filtering a column by one or more criteria

In [47]:
movies[movies['Studio'] == 'Universal']

                                Rank     Studio       Gross  Year
Title
Jurassic World                     6  Universal  $1,671.70   2015
Furious 7                          8  Universal  $1,516.00   2015
Jurassic World: Fallen Kingdom    13  Universal  $1,309.50   2018
The Fate of the Furious           17  Universal  $1,236.00   2017
Minions                           19  Universal  $1,159.40   2015
...                              ...        ...         ...   ...
The Break-Up                     763  Universal    $205.00   2006
Everest                          766  Universal    $203.40   2015
Patch Adams                      772  Universal    $202.30   1998
Kindergarten Cop                 775  Universal    $202.00   1990
Straight Outta Compton           776  Universal    $201.60   2015

[109 rows x 4 columns]

In [59]:
released_by_universal = ((movies['Studio'] == 'Universal') & (movies['Year'] == 2015))

movies[released_by_universal].head()

                      Rank     Studio       Gross  Year
Title
Jurassic World           6  Universal  $1,671.70   2015
Furious 7                8  Universal  $1,516.00   2015
Minions                 19  Universal  $1,159.40   2015
Fifty Shades of Grey   165  Universal    $571.00   2015
Pitch Perfect 2        504  Universal    $287.50   2015

In [67]:
mid_80s = movies['Year'].between(1983, 1986)
movies[mid_80s]

                                      Rank     Studio     Gross  Year
Title
Return of the Jedi                     222        Fox  $475.10   1983
Back to the Future                     311  Universal  $381.10   1985
Top Gun                                357  Paramount  $356.80   1986
Indiana Jones and the Temple of Doom   403  Paramount  $333.10   1984
Crocodile Dundee                       413  Paramount  $328.20   1986
Beverly Hills Cop                      432  Paramount  $316.40   1984
Rocky IV                               467        MGM  $300.50   1985
Rambo: First Blood Part II             469    TriStar  $300.40   1985
Ghostbusters                           485   Columbia  $295.20   1984
Out of Africa                          662  Universal  $227.50   1985

In [76]:
has_dark_in_title = movies.index.str.lower().str.contains('dark')
movies[has_dark_in_title]

                                Rank           Studio       Gross  Year
Title
Transformers: Dark of the Moon    23        Paramount  $1,123.80   2011
The Dark Knight Rises             27  Warner Brothers  $1,084.90   2012
The Dark Knight                   39  Warner Brothers  $1,004.90   2008
Thor: The Dark World             132      Buena Vista    $644.60   2013
Star Trek Into Darkness          232        Paramount    $467.40   2013
Fifty Shades Darker              309        Universal    $381.50   2017
Dark Shadows                     600  Warner Brothers    $245.50   2012
Dark Phoenix                     603              Fox    $245.10   2019

### Grouping data

In [87]:
movies['Gross'].str.replace('$', '', regex=False).str.replace(',', '', regex=False)

Title
Avengers: Endgame               2796.30
Avatar                          2789.70
Titanic                         2187.50
Star Wars: The Force Awakens    2068.20
Avengers: Infinity War          2048.40
                                  ...
Yogi Bear                        201.60
Garfield: The Movie              200.80
Cats & Dogs                      200.70
The Hunt for Red October         200.50
Valkyrie                         200.30
Name: Gross, Length: 782, dtype: object

In [91]:
movies['Gross'] = movies['Gross'].str.replace('$', '').str.replace(',', '').astype(float)

AttributeError: Can only use .str accessor with string values!

In [95]:
movies['Gross'].mean()

439.0308184143226

In [99]:
studios = movies.groupby('Studio')
studios

In [103]:
studios['Gross'].count().sort_values(ascending=False).head(10)

Studio
Warner Brothers    132
Buena Vista        125
Fox                117
Universal          109
Sony                86
Paramount           76
Dreamworks          27
Lionsgate           21
New Line            16
TriStar             11
Name: Gross, dtype: int64